##Below commands reprt area, cell, qor, resources, and timing information needed to analyze the design

report_timing > dc_reports/timing.rpt
report_area > dc_reports/area.rpt
report_cell > dc_reports/cell.rpt
report_qor > dc_reports/qor.rpt
report_resources > dc_reports/resources.rpt
